STL_IGU_25_FH_25/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//AER 4 setup
dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet1
    {
        type            fixedValue;
        value           uniform (0 0 -0.13);//0.13 = AER 1; 0.26 = AER 2; 0.52 = AER 4
    }
    inlet2
    {
        type            fixedValue;
        value           uniform (0 0 -0.13);
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0.2);//0.2 0.4 0.8
    }
    windowsmall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    door
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    columns
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    windowbig
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    ceiling
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    floor
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    wallwindow
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    walldoor
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    walloutside
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    wallinside
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    emission_surface
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
